app/Controllers/UserController.php

   public function index()
   {
      $session = \Config\Services::session();
      $message = $session->getFlashdata('message');
      $std = new Users();
      $data['user'] = $std->findAll();
---
SELECT *
FROM `user`

   public function editUser($id)
   {
      $session = \Config\Services::session();
      if (!empty($id)) {
         $std = new Users();
         $result = $std->where('id',$id)->findAll();
---
SELECT *
FROM `user`
WHERE `id` = '15'